In [3]:
import pandas as pd

## Series

In [8]:
## creating empty series
d = pd.Series()
d

Series([], dtype: object)

In [10]:
print(type(d))

<class 'pandas.core.series.Series'>

In [18]:
d = pd.Series(17)
d

0    17
dtype: int64

In [20]:
t = (10,11,12)
d = pd.Series(t)
d

0    10
1    11
2    12
dtype: int64

In [22]:
d = pd.Series([45,78,54,445,78])
d

0     45
1     78
2     54
3    445
4     78
dtype: int64

In [24]:
### Creating series with array
import numpy as np
arr = np.array([1,2,3,4])
d1=pd.Series(arr)
d1

0    1
1    2
2    3
3    4
dtype: int32

In [26]:
arr2 = np.array([[1,2],[3,4],[5,6]])
arr2.shape

(3, 2)

In [28]:
s2 =pd.Series(arr2)

ValueError: Data must be 1-dimensional, got ndarray of shape (3, 2) instead

In [30]:
d

0     45
1     78
2     54
3    445
4     78
dtype: int64

In [32]:
## Using dictionary
d = {'a':1,'b':2,'c':3,'d':4}
d.values()

dict_values([1, 2, 3, 4])

In [34]:
d.keys()

dict_keys(['a', 'b', 'c', 'd'])

In [36]:
d.items()

dict_items([('a', 1), ('b', 2), ('c', 3), ('d', 4)])

In [38]:
d['a']

1

In [42]:
b=pd.Series(d)
b

a    1
b    2
c    3
d    4
dtype: int64

In [44]:
b[0]

C:\Users\Rahul\AppData\Local\Temp\ipykernel_23948\172979841.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  b[0]

1

In [46]:
b['a']

1

In [48]:
import numpy as np

In [50]:
s1=pd.Series(arr_2)
s1

NameError: name 'arr_2' is not defined

In [52]:
## Slicing operations
d = pd.Series([1,2,3,5,47,98,7,8,6,32,78,2,8,289,258,78])
d[:-8:2]

0     1
2     3
4    47
6     7
dtype: int64

In [54]:
d[0:9]

0     1
1     2
2     3
3     5
4    47
5    98
6     7
7     8
8     6
dtype: int64

In [56]:
d[[4,5,3,6]] ##  multiple index

4    47
5    98
3     5
6     7
dtype: int64

In [58]:
d[4]=34 ## chaning the element

In [60]:
d[[4,5,3,6]]

4    34
5    98
3     5
6     7
dtype: int64

In [62]:
d

0       1
1       2
2       3
3       5
4      34
5      98
6       7
7       8
8       6
9      32
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

In [64]:
arr3 = np.array([1,2,4,6])
s =pd.Series(arr3,index=['one','two','three','four'])
s

one      1
two      2
three    4
four     6
dtype: int32

In [66]:
arr4 = np.array([1,2,4,6])
s1 = pd.Series(arr4)
s1

0    1
1    2
2    4
3    6
dtype: int32

In [68]:
print(s)

one      1
two      2
three    4
four     6
dtype: int32

## DataFrame

In [71]:
import pandas as pd
d = pd.DataFrame()

In [73]:
print(d)

Empty DataFrame
Columns: []
Index: []

In [75]:
d

Empty DataFrame
Columns: []
Index: []

In [77]:
print(type(d))

<class 'pandas.core.frame.DataFrame'>

In [79]:
data =[['abc',1],['def',2],['ghi',3],['','hij'],['klm','a']]
data

[['abc', 1], ['def', 2], ['ghi', 3], ['', 'hij'], ['klm', 'a']]

In [81]:
d1 = pd.DataFrame(data)
d1

     0    1
0  abc    1
1  def    2
2  ghi    3
3       hij
4  klm    a

In [83]:
d=pd.DataFrame(data,columns=['A','B'],index=['A','B','C','D','E'])  ## changing the index

In [85]:
d

     A    B
A  abc    1
B  def    2
C  ghi    3
D       hij
E  klm    a

In [87]:
## dataframe using dictonary

import pandas as pd
data={'name':['a','b','c','d','e','f'],'age':[45,12,48,25,12,56]}

In [89]:
d=pd.DataFrame(data)
d

  name  age
0    a   45
1    b   12
2    c   48
3    d   25
4    e   12
5    f   56

In [91]:
d.rename({'name':'Candidate','age':'Age_years'},axis=1,inplace=False)

  Candidate  Age_years
0         a         45
1         b         12
2         c         48
3         d         25
4         e         12
5         f         56

In [93]:
d

  name  age
0    a   45
1    b   12
2    c   48
3    d   25
4    e   12
5    f   56

In [95]:
d.rename({'name':'Candidate','age':'Age_years'},axis=1,inplace=True)

In [97]:
d

  Candidate  Age_years
0         a         45
1         b         12
2         c         48
3         d         25
4         e         12
5         f         56

In [99]:
d.rename({'Candidate':'Candidate112','Age_years':'Age_years112'},axis=1,inplace=True)

In [101]:
d

  Candidate112  Age_years112
0            a            45
1            b            12
2            c            48
3            d            25
4            e            12
5            f            56

In [103]:
## Accessing the elements from dataframe
data=[['ALex',10,'Maths'],['Bob',12,'Science'],['Kelly',15,'Eco'],
      ['Boris',14,'Geo'],['Ken',18,'English']]

data

[['ALex', 10, 'Maths'],
 ['Bob', 12, 'Science'],
 ['Kelly', 15, 'Eco'],
 ['Boris', 14, 'Geo'],
 ['Ken', 18, 'English']]

In [105]:
data[2][0]

'Kelly'

In [107]:
data[2][0]='asdf'

In [109]:
data

[['ALex', 10, 'Maths'],
 ['Bob', 12, 'Science'],
 ['asdf', 15, 'Eco'],
 ['Boris', 14, 'Geo'],
 ['Ken', 18, 'English']]

In [113]:
d=pd.DataFrame(data,columns=['Name','Age','Subject'])
d

    Name  Age  Subject
0   ALex   10    Maths
1    Bob   12  Science
2   asdf   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [115]:
d.Name

0     ALex
1      Bob
2     asdf
3    Boris
4      Ken
Name: Name, dtype: object

In [117]:
## accessing one single column
d['Name']

0     ALex
1      Bob
2     asdf
3    Boris
4      Ken
Name: Name, dtype: object

In [119]:
d[['Name','Subject']]

    Name  Subject
0   ALex    Maths
1    Bob  Science
2   asdf      Eco
3  Boris      Geo
4    Ken  English

In [121]:
d.iloc[1,1]

12

In [125]:
d.iloc[0,0] ="ALEX"  # changing an element
d

    Name  Age  Subject
0   ALEX   10    Maths
1    Bob   12  Science
2   asdf   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [127]:
d['Gender'] = ["Male","Female","Male","Female","D"]  # initialize and add a new column to the DataFrame
d

    Name  Age  Subject  Gender
0   ALEX   10    Maths    Male
1    Bob   12  Science  Female
2   asdf   15      Eco    Male
3  Boris   14      Geo  Female
4    Ken   18  English       D

In [129]:
d['Age'] = d['Age'] - 1   # d['Age']-=1
d

    Name  Age  Subject  Gender
0   ALEX    9    Maths    Male
1    Bob   11  Science  Female
2   asdf   14      Eco    Male
3  Boris   13      Geo  Female
4    Ken   17  English       D

In [131]:
d.iloc[:,[0,1]] # Index location

    Name  Age
0   ALEX    9
1    Bob   11
2   asdf   14
3  Boris   13
4    Ken   17

In [133]:
d.iloc[[3,1],[0,1]]  # [row,col]

    Name  Age
3  Boris   13
1    Bob   11

In [135]:
d.iloc[1:3,[0,1]]

   Name  Age
1   Bob   11
2  asdf   14

In [137]:
d.iloc[1]  # access row 1

Name           Bob
Age             11
Subject    Science
Gender      Female
Name: 1, dtype: object

In [139]:
pwd

'C:\\Users\\Rahul\\Documents\\Data Science Class\\Home_Practise\\programming_python\\Machine Learning and Library'

In [143]:
## to acces the single element we use iloc it will always work with index
d.iloc[0,2] ## index of row ,columns

'Maths'

In [145]:
d.loc[:,1]

KeyError: 1

In [147]:
## loc will work on rows as well as names of columns
d.loc[:2,['Name','Subject']]

   Name  Subject
0  ALEX    Maths
1   Bob  Science
2  asdf      Eco

In [151]:
# Modify multiple values
d.iloc[:2,0]= ['abc','xyz']
d

    Name  Age  Subject  Gender
0    abc    9    Maths    Male
1    xyz   11  Science  Female
2   asdf   14      Eco    Male
3  Boris   13      Geo  Female
4    Ken   17  English       D

In [153]:
d['Age']

0     9
1    11
2    14
3    13
4    17
Name: Age, dtype: int64

In [155]:
d.loc[:,'Age']

0     9
1    11
2    14
3    13
4    17
Name: Age, dtype: int64

In [157]:
d

    Name  Age  Subject  Gender
0    abc    9    Maths    Male
1    xyz   11  Science  Female
2   asdf   14      Eco    Male
3  Boris   13      Geo  Female
4    Ken   17  English       D

In [159]:
d.loc[:,'Age']

0     9
1    11
2    14
3    13
4    17
Name: Age, dtype: int64

In [161]:
d

    Name  Age  Subject  Gender
0    abc    9    Maths    Male
1    xyz   11  Science  Female
2   asdf   14      Eco    Male
3  Boris   13      Geo  Female
4    Ken   17  English       D

In [163]:
c

NameError: name 'c' is not defined

In [165]:
d.iloc[:,[1,2]]

   Age  Subject
0    9    Maths
1   11  Science
2   14      Eco
3   13      Geo
4   17  English

In [167]:
d.iloc[:3,1:3]

   Age  Subject
0    9    Maths
1   11  Science
2   14      Eco